{"0": {"author": "Brave-Investigator62", "comment": "Among the police who opposed the protesters on the square were units from all over the country. The most infamous is the Berkut (Golden eagle) unit. Not all of them were from Kyiv. Berkut was recruited from other cities to disperse the Maidan. For example, the [Lviv Berkut refused to participate in the killings on the Maidan and voluntarily returned to Lviv](https://tsn.ua/ukrayina/berkut-na-kolinah-poprosiv-vibachennya-pered-lviv-yanami-336487.html). But residents met the buses with the policeman at home and demanded a public apology. A local priest saved the police officers from lynching.  \nBerkut was disbanded in 2014. Those who could pass re-certification continued to serve both in the police and during the war in Donbas. There were cases during the hostilities against the Russians in the Donbas, Maidan activists, and ex-Berkul residents [served in the same unit.](https://www.bbc.com/ukrainian/features-38069991)  \nLeaders who gave illegal orders to Bercut had quickly escaped to Russia after the killings at Maidan.[And they are already using force against protesters in Moscow.](https://www.pravda.com.ua/news/2019/08/4/7222711/) In Ukraine, there were trials of those who remained, some of them were exchanged for Ukrainian prisoners of war who were held in the \"DPR\"", "utc": "2023-03-20 20:54:47"}, "1": {"author": "woofieroofie", "comment": "&gt;True, the actual count will almost always be higher in situations like this. **Point I'm trying to make is that the US invasion of Iraq was just as horrible as the invasion of Ukraine.** War is messed up and superpowers should not be able to just get away with the atrocities they commit.", "utc": "2023-03-20 20:54:45"}, "2": {"author": "Bright-Tough-3345", "comment": "Ukraine needs to take Crimea back and send all those Russians back to where they came from.", "utc": "2023-03-20 20:54:40"}, "3": {"author": "GMEJesus", "comment": "Ukraine first, then we'll focus on other matters", "utc": "2023-03-20 20:54:32"}, "4": {"author": "CanadianJudo", "comment": "you seem to be mistaken i'm a strong supporter of Ukraine and sending aid to Ukraine.", "utc": "2023-03-20 20:54:17"}, "5": {"author": "99inchesofsnow", "comment": "This is just the most perfect, shining example of everything that's wrong with America right now. Man doesn't support Ukraine war, is immediately assumed to be \"far right facist fuckbag\".\n\nThis one-size-fits-all \"with us or against us\" thinking is so dumb.", "utc": "2023-03-20 20:54:16"}, "6": {"author": "PQ01", "comment": "Which allows us good points of concurrence.  \n\nI'm conversant with the Georgia stuff, but one of the contributing factors in my evolution to Trump-leaning independence is a familiarity with how remarkably the mainstream media can distort reality.  I'm also a huge skeptic vis-a-vis Covid-19 and the spinning of Russia and the Ukraine too, and I personally hope this will come to greater clarity in future.  \n\nYour last point is perhaps your best, but I think also universal, not just a US thing.  Divide and conquer.  As a lady who served as a former undersecretary figure hre once said, \"There is no left or right, there is only freedom and control.\"", "utc": "2023-03-20 20:54:14"}, "7": {"author": "Doorbo", "comment": "&gt;The insistance that the solution to a one-sided invasion and slaughter   \nof civilians should be anything other than the invader stopping said   \ninvasion and slaughter.\n\nNothing happened in Ukraine between 2014 and 2022. Euromaidan was not taken over by the far-right and co-opted by western politicians and money. Ukraine did not shell it's own citizens, nor did it allow far-right militias to terrorize and kill it's own people. Ukraine did not pursue neoliberalism and sell out it's industries to foreign powers. NATO did not encroach eastward over the past decades. Minorities were not brutalized at increasing rates. Leftist political parties and individuals were not banned and persecuted. Far-right glorification is absent.", "utc": "2023-03-20 20:54:08"}, "8": {"author": "jaaval", "comment": "Cheap oil is nice but Chinese economy is currently not doing very well and the most important factor for it is demand in western countries. China does better if the west does better. \n\nChina also imports a lot of food so global food prices increasing hurts them a lot. They want Ukrainian grain production to run at full speed. \n\nAlso China has lent a lot of money to third world countries through the belt and road program. Third world economy is suffering heavily due to global increase in energy and food prices and the risk Chinese banks hold in those loans has grown significantly. And China has already entirely lost the approximately $7B loans they had given to Ukraine.", "utc": "2023-03-20 20:53:54"}, "9": {"author": "I_Chose_A_User_Name", "comment": "I would support the USA sending exactly $0 to Ukraine.   \n\n\nIf they broker a peace deal, good. Hopefully we'll be able to break ties completely with them and let Europe step up to the plate.", "utc": "2023-03-20 20:53:53"}}