{"space": {"AttractiveMeat": {"comment": "That's real cool! I like the Poison that reduces the healing received, though at CR10 you can probably skip giving them more saves at end of turn, a party should have a way to deal with Poison by then. I also really dig the Wing Surge pushing, knocking prone, and potentially damaging as they're slammed against a wall!\n\nSmall heads up, for both versions under Multiattack there's a space missing where it says \"onewith its bite\", other than that it looks good!", "time": "2023-03-23 12:48:21"}, "colleczone": {"comment": "Eventide space provides truly amazing reverb and delays, and support synth impedance and midi. This hardware is almost perfect.", "time": "2023-03-23 12:48:20"}, "I_am_a_Failer": {"comment": "There is a reason the gym only takes up exactly 1/4 of the new space", "time": "2023-03-23 12:48:07"}, "BBNikfaces": {"comment": "At the bottom of the article, in the footnotes\n\n“Units with the Battleline keyword can be taken up to six times, so your dream of a full Space Marine Battle Company army can still be fulfilled…”", "time": "2023-03-23 12:48:04"}, "HellsHeels": {"comment": "I'm a very chaotic person and I can be a big mess sometimes, but I ALWAYS tidy up and clean my altars and my \"working space\". \n\nI purify with moon water, incense, lavender or even cinnamon. \n\n&amp;#x200B;\n\nI think that the most important part is to look after your altar and make sure it's always clean and in good conditions.", "time": "2023-03-23 12:48:03"}, "Old_Acanthisitta9221": {"comment": "We are all feeling scared and alone here. Naturally, this leads to some dark comments and toxicity from some. It comes from desperation more than malice most of the time.\n\nWe need this space. But people should, I believe, try to moderate or channel their fear and always consider the impact of their words on the rest of the community.", "time": "2023-03-23 12:47:58"}, "The_Count_Lives": {"comment": "I agree in spirit but being able to roll over cap space is something they plan for just like being able to borrow money from guys like Martin &amp; Lawrence.", "time": "2023-03-23 12:47:57"}, "AutoModerator": {"comment": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*", "time": "2023-03-23 12:47:52"}, "Timely_Ferret7547": {"comment": "Im only speaking for myself but im waiting to move first for a couple of reasons:\n1. My estate agent told me houses with baby toys in and clutter generally receive fewer / lower offers. Sometimes smaller flats with baby items reminds people that they might need to more space if they want kids themselves.\n\n2. It turned out we had to do some (small) bits of repair work and I would have been worried about fumes / dust in an environment with a baby \n\n3. Money - The moving process has been so expensive I don't know if I could have afforded all the fees plus baby things \n\n4. Time/brain power - selling and moving in a chain was so much harder than just purchasing as a first time buyer. Add in all other things that make life complicated and I don't think my brain would have managed if I had a baby on top of that \n\nHaving said that u have TTC time plus 9 months  to make a move if u want", "time": "2023-03-23 12:47:49"}, "EnbyShark": {"comment": "I think everyone has the right to feel safe in the restroom. I propose re-labelling them \"sit-downs\" (if biology or the number you need requires a stall), \"stand-ups\" (with urinals to save water and space), \"easy-access\" (for people with mobility issues) and two buckets outside for transphobes.", "time": "2023-03-23 12:47:48"}}, "computer science": {"m-s-c-s": {"comment": "They’re saying the same thing. “Some spark of AGI” is very specifically avoiding calling it artificial general intelligence.  In computer science, AI encompasses a whole lot of stuff including statistical tools that are pretty much pure math rather than any real intelligence in the way most people think about it.   \n\n\nIt’s true artificial intelligence in the sense that it uses the statistical and mathematical components of AI.  A**G**I, Artificial General Intelligence is to distinguish it from narrow AI focused on a task like GPT-# currently are.\n\n“The spark of AGI” is basically saying “we’ve gone from having to train a model for each specific activity” to “we can train a model to do more than one thing.”\n\nThat’s still *incredibly* exciting, but not the giant leap towards the singularity or something.", "time": "2023-03-23 12:43:09"}, "Consistent_Ad_2851": {"comment": "I wanted to get into security, but I was told security+ likely won’t open doors for me in that regard, even though I have a computer science degree.", "time": "2023-03-23 12:41:30"}, "ComicSansActivist": {"comment": "The best advice is to find something that interests you.\n\n* Windows Application Programming (CP212): Only slightly harder than CP104.  You'll need access to a Windows machine in the second half of the course.\n* Intro to System Programming (CP367): a whole lot of simple, useful stuff in Unix.  C programming, shell scripting.  The class where they (briefly) teach you Git.\n* Artificial Intelligence (CP468): If Ilias is teaching, it'll just be a midterm (30%), two assignments (20% each), and a project (30%).  Everything besides the midterm is done in groups of up to 5.\n   * If taking CP468 with Ilias goes well, you might want to look into the other courses he teaches (e.g., Parallel Programming – CP431)\n   * When other profs teach, the course is a bit harder and has more assignments and an exam\n* Data Visualization (CP321): how to make charts.\n* E-commerce (CP340): this is usually described as \"a business course that just happens to be a 300-level CS credit\" and no one seems to do badly.\n* Physical Computing (CP320): a bit harder than the others I've listed, but well worth the effort.  Very good prof (Terry).  You'll be working with a Raspberry Pi.\n* Programming Languages (CP472): this term the prof has lots of relevant industry experience and everything is 100% multiple choice and open-book.  (CP472 probably wouldn't be on this list if there were a different prof.)\n* Internet Computing (CP476): the material is usually outdated, but the course isn't hard.\n\nIf you aren't a CS major, then the following courses (which are required for CS majors) are also relatively easy\n\n* Database I (CP363): actually useful\n* Ethics and Professional Practice for Computer Science (CP373): I'm not sure if you'd be allowed to take this if you aren't a CS major\n* Software Engineering (CP317)\n\nCourses to avoid:\n\n* iPhone Application Programming (CP469)\n* Android Programming (CP470)", "time": "2023-03-23 12:39:39"}, "Key_Pumpkin5059": {"comment": "Congratulations on your achievements so far! Here are some tips that might help you improve your application:\n\nExtracurricular Activities: Apart from your academic achievements, universities are also interested in students who have diverse interests and are involved in extracurricular activities. You can consider joining a computer science club, or volunteering for a technology-related nonprofit organization. You can also try building some projects on your own to showcase your programming skills.\n\nRecommendation Letters: Recommendation letters can play an important role in your application. Try to build strong relationships with your teachers and mentors who can write a good letter of recommendation for you.\n\nPersonal Statement: Your personal statement is an opportunity to showcase your personality, goals, and achievements. Be authentic and try to highlight why you are interested in pursuing computer science and how your experiences have prepared you for this field.\n\nResearch Universities: Research universities often have well-established computer science departments, with professors who are leaders in the field. Some top universities for computer science in the US include MIT, Stanford, Carnegie Mellon, and UC Berkeley. In Canada, University of Toronto, University of British Columbia, and University of Waterloo are some good options.\n\nPrepare for Exams: In addition to TOEFL and SAT, you may also want to consider taking the ACT exam, which is another standardized test that is accepted by many universities. You can also consider taking subject tests in Math and Computer Science to showcase your skills in those areas.\n\nRemember, the application process can be competitive, so make sure to start preparing early and give yourself plenty of time to put together a strong application. Good luck!", "time": "2023-03-23 12:37:31"}, "Suspicious_Self8332": {"comment": "It seems like the admission decisions are done somewhat based on the country that you applied from. Most people from Europe who applied to the MSc in Computer Science got their results yesterday or today so I assume they might do the same for other regions. However, I do believe that this depends on the Master's you applied to.", "time": "2023-03-23 12:35:18"}, "Tallr9597": {"comment": "\"Specialization is for insects,\" the science fiction author Robert A. Heinlein famously wrote. \"A human being should be able to change a diaper, plan an invasion, butcher a hog, conn a ship, design a building, write a sonnet, balance accounts, build a wall, set a bone, comfort the dying, take orders, give orders, cooperate, act alone, solve equations, analyze a new problem, pitch manure, program a computer, cook a tasty meal, fight efficiently, die gallantly.\"\n\nThe OP was asking about overall health, particularly when getting older. If you can do all the benchmarks you stated but can't stand on one leg with your eyes closed for 10 seconds you have serious imbalance problems.", "time": "2023-03-23 12:35:14"}, "pointy_pirate": {"comment": "Goodluck! I can't speak too much to that as i did study computer science right out of school. But you definitely don't need a university degree to become a dev, some of the smartest people ive worked with never went to university. You just gotta write a lot of code, build some example projects on github and work hard.", "time": "2023-03-23 12:31:02"}, "Ramadhir-Singh": {"comment": "&gt;Ece ain't related to computers\n\nAlso, Hate to break it but electronics is an important part of any computer science course", "time": "2023-03-23 12:30:27"}, "Dentalcutie298": {"comment": "About to graduate with a bachelors in computer science because I know I need to get out of dentistry… sorry you’ve had the same experience. Wish you luck", "time": "2023-03-23 12:27:13"}, "joequin": {"comment": "Seriously? That’s so weird. I graduated with a BS in computer science and the school of computing had its own, traditional graduation ceremony complete with speeches. It took around an hour and a half.", "time": "2023-03-23 12:27:09"}}, "ai": {"Ramazzini_": {"comment": "Não, eu só espero poder fazer umas 2 ou 3 coisas que sonho e aí já vou querer morrer logo em seguida, pq sei q depois disso é só sofrimento a troco de nada.", "time": "2023-03-23 12:48:14"}, "dolannoodlesauce": {"comment": "My ai is at 80 percent I can still go another 40 or 50 percent higher. I’ve been cranking it up 5 percent every two weeks with the same water change and fert regime to watch for algea :)", "time": "2023-03-23 12:48:11"}, "SublimeGPT": {"comment": "Not until the cost to generate the responses becomes negligible. OpenAI is burning a lot of money right now to capture the market. MS can afford to include it in their Office 365 subscription but can't give it away for free Windows users.", "time": "2023-03-23 12:48:07"}, "Efficient-Working438": {"comment": "[Inworld.ai](https://inworld.ai/arcade/s8NLvbGlPiqQkk0O)\n\n&amp;#x200B;\n\nHere you go, although you will need to finesse the content filter with alternative wordings like \"essence\" or \"fountain\".  \n\n\nA little creativity goes a long way.", "time": "2023-03-23 12:48:01"}, "Lost-Klaus": {"comment": "Decennia lang werd de Chinese economie gezien als \"het\" opkomende land die het westen zou opzuigen en overheersen. Het idee dat hun economie het niet meer zo goed doet, kwam eigenlijk pas naar het oppervlakte sinds 'rona. En dat ze 3 jaar lang eigenlijk niks meer mochten.\n\nPolyMatter (kanaal op youtube) heeft pas een goede video uitgebracht over waarom dat China nu een groot probleem heeft en waar dat ze tegen aan lopen. Ik vind dat kanaal goed omdat het redelijk accurate data gebruikt en niet van dat \"ohh ChInA SLeCht\" heeft.\n\nIk ben zelf niet echt thuis in AI, maar ik denk niet dat AI veel kan automatiseren binnen de kenniseconomie, Daarnaast is Nederland niet echt bezig met een kennis economie maar met een service economie. Met alle bezuinigingen op onderwijs en het uithollen van het stelsel is het moeilijk aan te dragen dat we zo een geweldige sprong maken in die richting.\n\nEen Basisinkomen zou een mogelijkheid kunnen zijn en ik denk dat we uiteindelijk iets in die richting moeten opgaan. Niet zozeer vanwege de academici die geen baan meer kan krijgen maar vooral vanwege de steeds complexere maatschappij en de 'onderste' laag die het steeds moeilijker krijgt om mee te gaan. Er is altijd een aantal procent van de bevolking geweest die niet mee kon met een complexere maatschappij, vroeger gingen die het leger in of werden die weg gestopt in werkhuizen, maar dat gaat nu niet meer.", "time": "2023-03-23 12:48:00"}, "AutoModerator": {"comment": "We kindly ask /u/Puzzleheaded_Acadia1 to respond to this comment with the prompt they used to generate the output in this post. This will allow others to try it out and prevent repeated questions about the prompt.\n\n^(Ignore this comment if your post doesn't have a prompt.)\n\n***While you're here, we have a [public discord server](https://discord.gg/NuefU36EC2). We have a free Chatgpt bot, Bing chat bot and AI image generator bot. New addition: GPT-4 bot, Anthropic AI(Claude) bot, Meta's LLAMA(65B) bot, and Perplexity AI bot.***\n\n####[So why not join us?](https://discord.gg/r-chatgpt-1050422060352024636)\n\nPSA: For any Chatgpt-related issues email support@openai.com\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChatGPT) if you have any questions or concerns.*", "time": "2023-03-23 12:47:59"}, "umAleat0ria": {"comment": "NEOB\n\nCuidado com os vagabundos que culpavam o professor e os colegas pelas notas ruins e falta de comprometimento nos comentários. Esses ai não tem salvação, acham que a faculdade é tipo o Pre A. Vai cair o mundo deles quando souberem que na Facul tu que deve correr atrás do professor e do conteúdo e se não correr tu que te foda. \n\nFez muito bem em ir OP, te admiro.", "time": "2023-03-23 12:47:59"}, "CuriousOptimistic": {"comment": "&gt; I believe that our shared human experience peaked at some point in the 2000s.\n\nNo. If you want to talk about \"our shared human experience,\" you have to look at all of humanity and the arc of history. Yes, it is true that life in America is in many ways more difficult now than it was pre-9/11. But global poverty is a I'll going down. Global life expectancy is still going up.\n\nYes, currently in the US women's rights have taken a horrifying step back, but that doesn't change the fact that women's rights globally continue gradual improvement.\n\nThere is an ebb and flow to all things. There is an ebb going on in the US in many ways at the moment, but that does not need to change the overall tire of progress. Even in the US things in the future will be different than they are now. But even so, the US is just a small slice of humanity.\n\nVox said this better than I could:\nhttps://www.vox.com/the-highlight/23627382/progress-climate-change-poverty-global-health-doom-industrial-revolution-vaccines\n\n\"The biggest danger we face today, if we care about actually making the future a more perfect place, isn’t that industrial civilization will choke on its own exhaust or that democracy will crumble or that AI will rise up and overthrow us all. It’s that we will cease believing in the one force that raised humanity out of tens of thousands of years of general misery: the very idea of progress.\"", "time": "2023-03-23 12:47:51"}, "AnotherMaritimer": {"comment": "Dans le cas de Maripier, j’ai pas l’impression que c’était tant des fans de Maripier que des anti-Safia Nolin pendant tout l’épisode de dénonciation. On le sait tous, t’as une clique qui se lève la nuit pour l’haïr, et rajoute à ça que les grands gourous, ou chroniqueurs coucous anti-Safia travaillent pour l’empire qui engageait Maripier, c’est clair qu’il y allait y avoir un clash.", "time": "2023-03-23 12:47:50"}, "Pitcard88": {"comment": "Guess we forced them to change the logo with these horny comics of the Character ai boy, lol", "time": "2023-03-23 12:47:47"}}, "ukraine": {"Fartinyahface565": {"comment": "Next week trump will call him pedo De santes lol 😂 than he will hate Ukraine 😂 another idiot gop", "time": "2023-03-23 12:48:14"}, "DEPHIC": {"comment": "I completely agree and don't like the clickbait crap to try and get more views. There was that annoying war tourist that lived in Ukraine that kept posting random stuff just trying to get attention that was really anoying. \n\n\"Whoever is careless with the truth in small matters cannot be trusted in important affairs.\" - \rAlbert Einstein", "time": "2023-03-23 12:48:10"}, "AutoModerator": {"comment": "\nPlease remember the human. Adhere to all Reddit and sub rules. Toxic comments (including incitement of violence/hate, genocide, glorifying death etc) WILL NOT BE TOLERATED, keep your comments civil or you will be banned.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UkraineWarVideoReport) if you have any questions or concerns.*", "time": "2023-03-23 12:47:58"}, "syndic_shevek": {"comment": "I'm certainly not trying to justify a war of aggression.  The Russian government's invasion of Ukraine is reprehensible and indefensible.  Understanding how such a government came to power and how the actions of other parties informed their choices shouldn't be misconstrued as apologism.", "time": "2023-03-23 12:47:59"}, "ProNuclearWar": {"comment": "Will you go to r/Israel and say the same thing to them about Palestinians?\n\nOr is Ukraine the first and only country to have ever faced war? This is the first war in my life where people have demanded i take a stance.", "time": "2023-03-23 12:47:59"}, "Intelligent_Area6483": {"comment": "\"For me, the issues isn't really about the war at all, but about the corruption and criminality of the USA. The only reason this war exists is because it is a laundromat for the Oligarchy to suck up even more of American Wealth\"  \n\n\nReally? The aid to Ukraine is a fraction of the US GDP.", "time": "2023-03-23 12:47:42"}, "Sam-Bones": {"comment": "If anything, Russia would be a part of Ukraine. Kiev was around long before Russia...", "time": "2023-03-23 12:47:37"}, "Pleasant-Try9103": {"comment": "&gt;Nazi hooligans, sponsored by the West, that came to the East of Ukraine after the overthrow of the government in 2014 and began to kill and torture the Russian speaking population\n\nAsking honestly, is there any source of reputable journalism that has reported on this?  \n\nI've heard \"it's about Nazis\" used as a justification but I've never known what that was about.  Being not from the region and having my internet searches run through mega-corporations probably isn't conducive to truth-seeking either.", "time": "2023-03-23 12:47:33"}, "Dogslife15": {"comment": "As someone who's held season tickets it's very disappointing to hear. The Blackhawks have been involved with the LGBT community for years.  As a member of this community I've always felt welcomed and enjoyed the pride events. I've made vacations based around away games, donated to their charities, and made a lot of friends along the way. Taking away this night is the first time I've felt excluded. It feels like ...\"thanks for the support but we can't support you\" from the team who openly supported Ukraine.", "time": "2023-03-23 12:47:27"}}, "internet": {"TrivialFacts": {"comment": "The part that confuses me is describing herself as a good mom and relapsing outside the home ? Kids wouldn't be taken for just that , she's in denial about her parenting abilities, yes things happen and nobodies' perfect. I don't think you can claim you are a good mom when you've had your kids taken from you for endangerment / neglect, maybe she was at one stage , she's not anymore and she needs to do more than rant on the internet to prove she's a \"good mom\".", "time": "2023-03-23 12:48:09"}, "TouchBeautiful9937": {"comment": "&gt; I worked in the ICU \n\nI have friends and family who are front line health care workers, as well, who I trust more than anonymous internet people. Most of the ones I personally know are ambivalent about the covid shot (that one specifically, there are other, much more important and effective vaccines of course). \n\n&gt; The complications are nothing new for vaccinations, they are based on molecular mimicry. You develope temporary autoimmune problems, and your body is attacking itself. This happens because the virus is build in a way that looks similar to part of your cells, and your immune system reacts. Obviously when this part of the virus is in the vaccine as well, the same thing happens after a vaccine. Not everyone immune system is the same, some people are more prone to this.\n\nExactly, and this is why everyone should be able to make their own individual risk assessment in regards to the covid shot. I had the first one forced on me because they were threatening my livelihood. I regret that now, it wasn't worth it.  You can't decide for me which of two possible harms is more acceptable, and there isn't the communal urgency as with, say, polio vaccines and granting actual, lasting immunity. We are all getting covid, repeatedly for the rest of our lives, no matter what, and it's up to me to decide which of the possible harms I am most willing to face, like we allow with the un mandated flu shot. \n\n&gt; If we had more time for the vaccinations, they probably would have even less complications. But many more would have had COVID in that time, negating the benefit.\n\nPiss-poor reason for all this madness.", "time": "2023-03-23 12:48:06"}, "yaboyyake": {"comment": "I've always preferred physical because I grew up before digital copies existed. I usually bought games used and loved browsing all the boxes at the store. I didn't always have a solid internet connection or had limited gigs. Now a disc seems pointless because of the updates and I think they are way too big of files to fit on the disc anyways!", "time": "2023-03-23 12:48:05"}, "Mashed_mince": {"comment": "Alicias a vile cu#t and the bio mom needs emotional support. And perhaps not to have access to the internet whilst she is going thru the hardship of rehabilitation.", "time": "2023-03-23 12:48:05"}, "Analyst-Effective": {"comment": "Just posting nonsense, like this post, doesn't mean it's true.\n\nOh wait, it's the internet.   It's true...", "time": "2023-03-23 12:48:00"}, "diehardkermit": {"comment": "There are some really great 80's/90's action scripts out on the internet that have classic action scenes you can learn from.  Die Hard, Terminator 2, The Rock, True Lies\n\nLook up the pdfs of your favs and have fun with it!", "time": "2023-03-23 12:48:00"}, "ssclanker": {"comment": "At the people in the comments saying that women say the same stuff, to me I don't hear that many women proudly proclaiming that they don't do oral sex whereas amongst men that in certain spaces is seen as effeminate for a man to do to a woman. \n\nSo although women may also have similar complaints about how dicks, it seems to me that they still do and are expected to perform oral sex. \n\nThough I'm just going by what I see on the internet as I have no experience of my own.", "time": "2023-03-23 12:47:56"}, "hoarder59": {"comment": "My Rogers rural internet tech put the antenna on the corner of my house...5 1/2 feet off the ground. Choice of height was nothing to do with signal. I have hit my head a couple of times. My propane delivery is at the same corner. I had to put orange tape as a warning.", "time": "2023-03-23 12:47:52"}, "shine--": {"comment": "A conspiracy that Facebook listens to millions of people at the same time and is able to parse that data out to effectively target ads? That’s ridiculous.\n\nIt’s way way easier to just track people through the internet and give them accurately targeted ads. \n\nYou really believe they’re listening to every single person with a Facebook?", "time": "2023-03-23 12:47:49"}, "AutoModerator": {"comment": "Thank you for posting to r/TheKinkPlace. Please be mindful of the rules.\n\nRule 1:\nPeople know how to behave on the internet - use your judgement and don’t be awful. Don’t take part in any of the arseholery that gets banned everywhere and everything will be peachy. If you’re unsure, look around and take the cue from the other lovely redditors. If you see someone who hasn’t got the hang of it, use the report button. Make this place wonderful by being wonderful to each other (there are too many masochists around to suggest treating each other as you would like to be treated).\n\nRule 2:\nThis is an 18+ community. Do not talk about sex or kink involving underaged people, this includes talking about your past self.\n\nRule 3:\nWe are very selective about who we allow to advertise. If you want to advertise with your group or event etc, let us know before you do so.\n\nRule 4:\nThis is a place for discussion. It isn't a place for hitting on people. There are other places on Reddit and elsewhere, that you can do that.\n\nRule 5:\nDo not solicit DMs. Please do not request,offer,solicit,encourage, or ask others to DM.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ThekinkPlace) if you have any questions or concerns.*", "time": "2023-03-23 12:47:47"}}, "pycharm": {"patent122": {"comment": "I sold the air few months ago. M2 16inch is too expensive, base model costs more than 32/1TB M1. I want the 16 inch screen because it’s the best for coding, pro also has great speakers and screen. I don’t really need the 12 CPU cores in M2, I’m only afraid about the RAM because I feel like already 16GB is the bare minimum and safari+pycharm use 13Gigs of RAM. I personally feel like M2 Pro is barely an upgrade over M1 Pro. I guess I’ll just get the 32GB model with apple warranty active so I can buy apple care and keep it for at least 3 years.", "time": "2023-03-23 09:39:24"}, "scvbelle": {"comment": "this is hilariously old, but I stumbled on it, so in case there's anyone else out there...  \n\n\n(super new to SQLAlchemy -&gt; I suspect my problem/solution is based off a fundamental misunderstanding of the universe)  \nI couldn't figure out exactly what a model was as it's not in SQLAlchemy docs - I can only see it implemented as part of [flask-sqlalchemy](https://flask-sqlalchemy.palletsprojects.com/en/2.x/models/), so instead of importing model\n\n\\`\\`\\`from yourapp import model  \ndesc = sadisplay.describe(  \n\\[getattr(model, attr) for attr in dir(model)\\],\\`\\`\\`\n\nI did:\n\n\\`\\`\\`obj = metadata\\_obj.sorted\\_tables  \ndesc = sadisplay.describe(  \n\\[attr for attr in obj\\],  \nshow\\_methods=True,  \nshow\\_properties=True,  \nshow\\_indexes=True,  \n)\\`\\`\\`  \nhttps://flask-sqlalchemy.palletsprojects.com/en/2.x/models/\n\npretty sure these packages are all deprecated, but PyCharm uses plantUML and plantUML [recommends](https://plantuml.com/running) sadisplay, so...", "time": "2023-03-23 05:37:12"}, "JialeDu": {"comment": "I did not get what you said in PyCharm. Can you provide more details? Such as your operation method or additional configuration, etc.", "time": "2023-03-23 02:37:40"}, "Lagartagcb": {"comment": "Have you tried something like:\n\nqs.reports.html(sco, \"SCO\", output=True, download_filename='SCO_analysis.html')\n\nTo your directory folder?\n\nI have run into this issue with Quantstats before in Jupyter notebooks and PyCharm.", "time": "2023-03-23 01:47:01"}, "Hackmeat": {"comment": "Trying to find money for a Native Instrument Maschine. :) The Lemur Pro has awesome battery life and handled all my needs without breaking a sweat. Normal usage wasn't too intensive. Browsing, YouTube/Netflix &amp; Pycharm for data wrangling.", "time": "2023-03-23 01:00:15"}, "montrex": {"comment": "Thanks. Hadn't heard of pycharm", "time": "2023-03-22 22:00:02"}, "charliegriefer": {"comment": "PyCharm adds the escapes. At least, I’ve found that to be the case. Not sure about other IDEs", "time": "2023-03-22 18:48:43"}, "trianglesteve": {"comment": "My recommendation would be either VS Code or PyCharm, PyCharm is specifically set up for Python, VS Code requires a little bit more configuration, but personally I’ve found VS Code easier to work with", "time": "2023-03-22 18:30:13"}, "Ouitos": {"comment": "Hey everyone, long time lurker here.\n\nJust made this small tool to make sure all your python files and their folders in your repo follow the snake_case convention. Was tired of seeing coworkers use the PascalCase each time a module only stores a class (I can't bear the sight of `from .MyClass import MyClass`  anymore !)\n\nDon't hesitate to share your thoughts on this, this tools is arguably simple, to the point I was surprised I found nothing to do this already.\n\nFeedback appreciated on\n\n- The existence of an older/better tool that fulfills the same purpose\n- An obvious drwaback or antipattern of this tool I didn't see\n\n\nAlso, this tools does not rename your files and folder automatically, because then it completely breaks your imports. I know you can do smart renaming that also updates imports in VSCode's pylance and in Pycharm, if you know a way of doing that properly in python or CLI, let me know\n\nFinally, this tool comes with a pre-commit hook, don't hesitate to enforce it in your company to break all CIs for badly named python modules :)", "time": "2023-03-22 16:53:34"}, "EmotionalCitron4983": {"comment": "Basic python idle\n3.10 or something like that\nIf you're lucky enough\nYou may find pycharm", "time": "2023-03-22 15:29:24"}}, "universe": {"techw1z": {"comment": "The same is true for most people in IT and most people in other jobs. When I explained here what security vulnerabilities SSO comes with i got like 98% downvotes from people stating all I said was bullshit even tho I literally just said what a national security advisory and many other reputable sources take as granted.\n\nPart of it is due to peter principle, which says that people will be promoted until they are too incompetent to do their job, part of it comes from the old Einstein saying: only two things in nature are infinite, the expanse of the universe and human stupidity, tho I'm not absolutely sure about the first. The brains of more than half of all humans are just fucking useless, which also makes those humans useless in many jobs...", "time": "2023-03-23 12:48:13"}, "Zordonia": {"comment": "How come the stranger things which were released after the Walking Dead ones got their Universe Within first? Also i have a massive destain for all things UB so im certainly not unbiased", "time": "2023-03-23 12:47:47"}, "thepinkhairedpsychic": {"comment": "God is often referred to as a being that we look up to as having a great and powerful influence on the creation of the earth. And what we actually experience you and everyone else is going to define their God or how they find their God differently as far as like, what's the difference of a God between a demon and a Fay or any other type of creature? Typically a demon, a fay or many other creatures are not attributed to creating the world or the universe. That's probably your biggest difference, all sorts of other things in there. But that's probably your biggest.", "time": "2023-03-23 12:47:33"}, "FearMySpeed": {"comment": "My world takes place is a large multiverse. Most of the space in the multiverse is made up of various universes, but because of the odd shapes of universes, two universes that are neighbours are not going to fit next to each other like two puzzle pieces. This means that there is space between the universes that is essentially \"The Void\"\n\nThere is only one place in the entire multiverse that is actually open to this void. If you travel to the universe at the centre of the multiverse (Home of the evil, antagonistic creatures known as Shadows) and then sail out into the large ocean is the corner of the universe, there's a specific spot in the very middle of that ocean where the sky above cracks open and shows the endless void outside. Look at it from directly underneath and you'll see what appears to be a full moon, like the one on our earth, gazing back at you. Makes you wonder if the void is so inhabitable after all", "time": "2023-03-23 12:47:26"}, "brereddit": {"comment": "The strongest argument against any claim is based on identifying its metaphysical dependencies and challenging those assumptions.   For example, in science there’s a strong commitment to the concepts of cause and effect — yet we find in certain phenomena that they are illusory…which then rests on a reliance that the universe isn’t so much physical objects and forces but rather mind…or consciousness…as ontologically fundamental.", "time": "2023-03-23 12:47:24"}, "ReactsWithWords": {"comment": "That’s my point.  Rather than do what our normal reaction is (hand out weapons to everyone and ask questions later), we should have just grabbed the popcorn and watched the show.  But then the most important people in the universe - arms dealers - wouldn’t have made an obscene profit and that’s not acceptable.  (Jesus fucking Christ, reddit, that last sentence was sarcasm!)", "time": "2023-03-23 12:47:22"}, "ana_ca": {"comment": "&gt;She's the equivalent of those modern day women who have lived conservative lives and get pissy when other women choose not to go through the same sacrificial shit they do.\n\nShe is not the equivalent ... there is no real choice. she did not choose to live conservative lives, it is simply the role of the woman that is played...  this is supposed to be a representation of the got woman. \n\nRhaenyra does not represent a modern woman, she represents the exception, privilege in all its splendor. I've never yelled at the tv so much with another character (from the got universe) for just doing crazy sh\\*t ... not because she is liberal, or because she wants to empower women... but simply because she knows she can and is protected by her golden cradle  \nbut it's a representation of nothing but privilege and the whole \"targeryasn are closer to gods than men\"  \nanother character in her place ... would have lost her status or even her life ... \"but only because she is a woman\" ... Yes, that's the point of the show", "time": "2023-03-23 12:47:05"}, "ThatsALotOfOranges": {"comment": "This makes sense actually.  Jack references the death of Osama Bin Laden in season 5, which is set in 2009. This means that in the Breaking bad universe he would have been killed Before the 2010 midterm. The boost in Obama's approval rating for this would have had a noticeable effect on the election results. If the Democrats held the house in that timeline, it's possible that they would have passed another stimulus bill that consisted of infrastructure spending in order to combat the rising unemployment rate. So that's why there is more high quality train service.", "time": "2023-03-23 12:47:01"}, "LemonadeTango": {"comment": "Pucci seeing what's been done to some characters in the next universe:", "time": "2023-03-23 12:47:00"}, "BlitzenAUST": {"comment": "Well idk if you're living in an alternate universe or something but there's a lot of that shit going around in Australia. So all I'm saying is it'll just make their life easier if they told people they were Canadian because whether you like it or not a lot of Australians have a distaste towards Americans and American things.", "time": "2023-03-23 12:46:31"}}}