{"kyiv": {"Webster_Check": {"comment": "Yeah Ukraine doesn't historically have friends against Russian active meddling in their internal politics. The 2014 protests have no precedence so the only explanation is the West made hundreds of thousands of Ukranians protest in Kyiv and other cities.", "time": "2023-03-25 17:02:15"}, "fsidemaffia": {"comment": "Tell that to the people in Kyiv that get hit by cruise missiles all the way from Russia ...", "time": "2023-03-25 16:56:38"}, "StolenValourSlayer69": {"comment": "Not really last resort, those have been being used by the regional defence units as anti-drone weapons. I saw a video from the fall where one was parked outside Kyiv and shot down a Shahed kamikaze drone", "time": "2023-03-25 16:54:24"}, "YuliiaR": {"comment": "Thanks! Sadly no link. I purchased it in Kyiv Pechersk Lavra years ago.", "time": "2023-03-25 16:51:47"}, "Electrical_Tip4975": {"comment": "Hahaha yeah, wouldn’t that be some shit! He goes the Rudolf Hess route and flys himself to Kyiv to negotiate a settlement.", "time": "2023-03-25 16:47:24"}, "Meem-Thief": {"comment": "Kyiv is the right spelling", "time": "2023-03-25 16:42:41"}, "RDBB334": {"comment": "Kyiv is the correct Ukrainian spelling", "time": "2023-03-25 16:42:16"}, "sirfuzzitoes": {"comment": "Preferably signed for in a train car in kyiv", "time": "2023-03-25 16:40:33"}, "bizaromo": {"comment": "&gt; The counter to agression, denying engagement until your enemy overextended and then swiftly (and aggressively) counterattacking rests on the very same problem. Skill and organization.\n\nThat's what Zaluzhnyi did to the Russians attacking Kyiv. That was a masterclass is getting the enemy to over extend beyond the capabilities of their supply lines. And overconfident Russia fell right into that trap!", "time": "2023-03-25 16:33:50"}, "TheOneGecko": {"comment": "How are they going to storm Kyiv if they don't have any tanks? Their only hope now is a \"peace deal\" to give them some time to rebuilt.", "time": "2023-03-25 16:28:04"}}, "planes": {"walteroblanco": {"comment": "Definitely not, you need way more planes and a solid army. Ive done exactly what youre trying to do here by 1946, and with a better army and air force. I go for 9/3 infantry artillery divisions with plenty of support, and the same for motorized and mechanized, as well as some armored divisions if i can. About 80 divisions minimun, aka some 1.3 million men. Then I just fight my way up central america and Mexico, for navy you just need subs to keep the naval invasions away.", "time": "2023-03-25 17:03:34"}, "matheus_santos2": {"comment": "maybe stop flexing your premium planes and play more matches?", "time": "2023-03-25 17:03:22"}, "Stef1309": {"comment": "Well, the AN-225 was a regular at the airport before her destruction. \nIf I recall correctly, they did some flight training here.\nI don't know when this exact bridge for the northern runway was built, but I'm sure they had some very heavy planes in mind.", "time": "2023-03-25 16:57:21"}, "easycheesybreezy": {"comment": "I’m skeptical, if there’s working planes there certainly isn’t fuel for them, it takes a lot of people to make one of those things fly", "time": "2023-03-25 17:02:50"}, "AccidentalyAEmpire": {"comment": "It's not a *slivered sword, * it's a Githyanki Silver Sword. They're shapeshifting psionic weapons used to cut the silver cords of astral travellers (essentially the thing that tethers your astral projection to your physical body), and so rare there's an entire branch of their society dedicated to retrieving lost ones from dead githyanki across the planes.\n\nThe first gith you meet (Lae'zel) is a child by the definition of her race as she has yet to kill a mind flayer on her own, and is certainly far below the rank needed to be given a Silver Sword, since only their most elite warriors are permitted to wield them. \n\nThe guy we meet with the dragon *might* have one, depending on his rank, and if he's powerful enough to will one into existence.", "time": "2023-03-25 17:02:25"}, "LeftHandStir": {"comment": "Like a few others here, I've owned one edition or another of pretty much every bag GR has made, going back to 2011, with the exception of a Radio Ruck. Here's what I'd say:\n\n The GR1 is pretty hard to beat. Mine is a 2013. I've rucked extensively with 2x 45lb plates in it, with and without hipbelt. One in the laptop compartment, one in the elastic pocket; just avoid bear crawls unless you ziptie the latter to the internal MOLLE. This GR1 was also my EDC for the better part of a decade. It's a little big for the modern office, but perfect if you're checking off multiple \"boxes\" (gym, etc) during your day. It's the ultimate do-it-all.\n\nThe GR2 2011 (40L, that's all they had then) was my first GR bag, and I used it in 4 challenges, a Scav, and Nasty. It's BIG; as in, it holds a LOT, but even on my 6'0\" 200lb frame, it's always been a big bag. I've traveled all over North America with it, planes/trains/automobiles, but it's best use (for me) honestly ended up being for my MMA training bag; all of the compartments keep gis, gloves, tape, nail clippers, change of clothes, disinfectant spray, extra contact lenses, flip flops, etc *really* we'll organized so you don't have to go searching.\n\nThe GR3 2020 is the bag *I* wished the GR2 was for travel. I prefer the single large compartment, and to use packing cubes to customize the layout I need for a specific trip's needs. It's a more adaptive format, provided you're willing to invest a little more in the extra organizing elements.\n\nThe Bullet 10L 2018 is pretty much just a day hiking bag for me. I'll throw it in another ruck when traveling and break it out as need be. Once it's got a hydration bladder in it, there's room for snacks, a jacket, bug spray, headlamp, but not much else.\n\nThe Bullet 15L laptop 2022 is a real game changer in the EDC department. It does everything the GR1 does in the way of office/MBA carry (laptop, extra monitor, cables, A4 notebook, pen/pencil/mouse bag, textbooks, etc) without looking like I'm *also* about to go summit a mountain.\n\nThe Rucker 4.0 25L 2023 is a fucking BEAST at its primary function. I load it up with anywhere between 45-100lbs depending on the days demands and it crushes. It came with the hipbelt and sternum strap standard, but can confirm the shoulder straps alone can handle large loads with ease. I've been incredibly impressed with the Vietnamese construction, and while I know some here hate on the new back panel fabric, I've found that a.) I'm not regularly dragging it behind a Humvee, b.) it doesn't hold \"stink\" as badly as the 1000D, and c.) The lumbar support is God for my frame (large ribcage/thoracic cavity, smaller hip structure for my size/weight).\n\nI hope the above helps. Personally I wouldn't want a Rucker as my do-it-all, because I think I'd find the plate pockets pretty annoying when they weren't serving their intended function, but obviously others here feel differently. It really depends on your use case scenarios. If you've got the need to buy *now*, GR1 26L or Rucker 25L (if you're going to be doing more EDC and hiking than rucking, I'd get a GR1. Reverse that, and I'd say get a Rucker). If it's travel you're concerned with, definitely go for your preference in the larger bags; just know they can be pretty conspicuous as an EDC when trying to shove under a desk or whatever. If you have patience and the budget for two bags, based on everything I've seen/read here, plus my experiences, I'd get the Long Range Rucker + 15L Bullet Laptop, when they're available, and cover all your bases.", "time": "2023-03-25 17:00:42"}, "Avelium": {"comment": "Sorry, not a military expert, just occasionally browsing FlightRadar :)  \nI remember seing this or similar Rivet Joint planes around Kaliningrad in Baltics, across border of Ukraine, in Barents Sea near Murmansk and Arkhangelsk Oblast, but never in Black Sea (there were only unmanned drones like downed recently Global Hawk).\n\nGuess it's not only for reconnaissance there but also as a political statement. Like 'oh so you didn't like our drone? well allow us to introduce this thick boy and his fellas, don't worry, they won't bite... if you stand still'. Similar thing with the Rivet Joint plane which for the fist time flew above Finland.", "time": "2023-03-25 16:57:52"}, "clegay15": {"comment": "My previous comment not withstanding: I agree with the OP that allowing Wrenn to bond with Realmbreaker while punishing Lukka for bonding with a Phyrexian seems...weird. The idea that there's a tree within Realmbreaker which wanted to reach out to Wrenn also seems weird. I'll give them credit: it's not like this is completely out of left field, but it sorta contradicts what's happened in the past? Furthermore, if Melira could give out vaccinations to people why hasn't she been doing it for a long while? \n\nThe overall storytelling choices of the main storyline have not been my favorite. I know Zhalfir is powerful, but I don't buy that Zhaldfir is powerful enough to stop New Phyrexia's army. I am also struggling to grasp why most planes in the multiverse have not succumbed to Phyrexia's might. Mirrodin fell apart after Karn left some glistening oil behind: why are all these other planes so successful in their defenses? \n\nOverall part of me feels like I was duped into believing Phyrexia was as big of a threat to the multiverse as they implied in the first place. I am hopeful that the last couple of episodes will help square this circle for me, but I am nervous it still won't add up.", "time": "2023-03-25 16:57:49"}, "cXs808": {"comment": "Wear a mask.  I don't smell shit on planes and it's great.", "time": "2023-03-25 16:56:58"}}, "chat gpt": {"WavingToWaves": {"comment": "Wtf 😂 They are using chatGPT to make up stories", "time": "2023-03-25 17:03:59"}, "stormy-seas-91": {"comment": "Maybe ask through chat gpt to see if it could help pull up a picture", "time": "2023-03-25 17:03:37"}, "grumpyfrench": {"comment": "ask gpt to summurizer your chat and start a new one with this prompt", "time": "2023-03-25 17:03:20"}, "i_x_Valkyrie_x_i": {"comment": "Writing is part of the thinking process, I think. We write to process and organize our thoughts. I think it’s similar to why we learn math- we may not EVER need to use a lot of the math we learn, but it isn’t about math, it’s about learning to be a problem solver who can approach obstacles in a logical and systematic way. Similarly, writing teaches us how to analyse our own thinking, as well as the information we consume, and organize our thoughts in a way that can be shared with others. \n\nI think the challenge is going to be learning to use ChatGPT and other AIs as part of that thinking process, similar to how we use calculators now. If you don’t understand the operations you’re trying to solve, the calculator is nothing more than a paperweight.", "time": "2023-03-25 17:02:58"}, "Spedunkler": {"comment": "Someone needs to ask chat gpt", "time": "2023-03-25 17:02:52"}, "madredditscientist": {"comment": "I'm often relying on Reddit when doing movie research, but there are many repetitive questions and the search function is not really good, so I built a ChatGPT-like bot based on thousands of posts and comment to embody the collective knowledge of the r/MovieSuggestions subreddit.\n\nSome example questions I took from actual Reddit posts:\n\n* [movies that take place in a day?](https://www.looria.com/bot/movies?q=movies+that+take+place+in+a+day%3F)\n* [movie about a man's struggle with loneliness](https://www.looria.com/bot/movies?q=movie+about+a+man%27s+struggle+with+loneliness)\n* [horror movies with great plot?](https://www.looria.com/bot/movies?q=horror+movies+with+great+plot%3F)\n\nIt's far from perfect and comes with limitations:\n\n* Outdated information: I'll try to improve this by factoring in recency of the posts and comments. I also want to add more statistical significance to the results, e.g. by clustering recommendations.\n* Hallucination: As always with these bots, they sometimes make things up. Broader data should help here. I also had to switch from GPT-4 to ChatGPT for cost reasons, which made the results less accurate.\n* Performance: Generating the answers is pretty slow and I'll look into improving this.\n\nTake it with a grain of salt and look at it as a fun experiment :) Would love to hear your feedback!", "time": "2023-03-25 17:02:44"}, "Dwengo": {"comment": "Thanks Chat GPT", "time": "2023-03-25 17:02:37"}, "AutoModerator": {"comment": "**Attention! [Serious] Tag Notice**\n\n : Jokes, puns, and off-topic comments are not permitted in any comment, parent or child.\n\n  : Help us by reporting comments that violate these rules.\n\n : Posts that are not appropriate for the [Serious] tag will be removed. \n\n Thanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ChatGPT) if you have any questions or concerns.*", "time": "2023-03-25 17:01:29"}, "JimBean": {"comment": "I get that. But when I posted the code, that was not my intention. To let some \"AI\" train on my comments.\n\nI'm not angry about that, I just feel ChatGPT is seriously over rated as AI.", "time": "2023-03-25 17:01:36"}}, "rockets": {"128thMic": {"comment": "Damn, Rockets be using GameSharks", "time": "2023-03-25 17:01:45"}, "xXOpticDakkersXx": {"comment": "The arena? The Seperatist rockets? The massive battle between clones and droids?", "time": "2023-03-25 16:59:57"}, "RunThePnR": {"comment": "Rockets were 6th seed and I think there was one 4th seed team.", "time": "2023-03-25 16:59:41"}, "super_pax_": {"comment": "That’s such a dumbass opinion when the rockets and spurs exist", "time": "2023-03-25 16:59:18"}, "CrispDollar-": {"comment": "We should be 40-34 in all reality. 3 losses that we had secured, vs Knicks, vs Rockets, and vs Mavs. This team easily could’ve been the 4th seed by now.\n\nGotta take what we can get tho, championship run here we come🔥", "time": "2023-03-25 16:54:57"}, "potatolord747": {"comment": "Scout: \"MOVE CYCLOPS MOVE, Come on come on come on!\"\n\n[Demoman wheels his wheelchair and Scout runs, as Scout trips and falls to the ground.]\n\nScout: \"WOAH, WHAT THE FU-\" [gets hit by four missiles, landing him on the medic's glass wall. One of Medic's doves looks at Scout.] \"Medic..\"\n\n[\"Meet the Medic\" text appears]\n\nHeavy: \"[Laughing loudly]\"\n\nMedic:\"When the patient Woke up, his skeleton is missing, and the Doctor was never heard from again!\"\n\n[Medic laughs alone. Half a second later, Heavy laughs with him as he slaps his hand on a tray knocking away the tools on it.]\n\nMedic: \"Anyway, that's how I lost my medical license [he chuckles, and a dove bursts out of heavy's chest.] Archimedes, no! It's filthy in there!\" [He wipes his hand on his vest and looks at Heavy for a second, who looks a tad offended,] \"Ugh, birds.\" [He chuckles and grabs the heart implant.]\n\nMedic: \"Now, no heart can withstand this voltage, but I'm very certain your heart-\"\n\n[Heavy's heart explodes, and remains knock one of Medic's doves off their perch.]\n\nHeavy: \"What was noise?\"\n\nMedic: \"The sound of progress my friend.\"\n\n[Medic goes to his fridge.]\n\nMedic: \"Ja, Perfect!\"\n\n[Medic takes a \"mega baboon heart\" revealing a BLU Spy's head being connected to a electrical battery.]\n\nBlue Spy: \"Kill Me.\"\n\nMedic, quietly: \"Later.\"\n\n[Closes fridge.]\n\nMedic: \"Where was I?, There we go...\" [Sticks heart onto a voltage meter. Places it to where the Medigun is pointing and the heart beats faster.]\n\n[The violin/string instrument in background gets faster in sync with the heart.]\n\nMedic: \"[Begins laughing evilly.\"]\n\nHeavy: \"Ha... ha... ha...\" [Looks worried.]\n\nMedic: \"[Continues laughing evilly.]\"\n\n[A flash of light explodes revealing the screen.]\n\n[The big heart is Übercharged, as it glows red with red-orange glows that look like silhouette cracks flowing.]\n\nMedic: \"Oh, that looks good. There!\"\n\n[Drops heart into Heavy's chest cavity.]\n\nHeavy: \"Should I be awake for this?\"\n\nMedic: \"Heh, well, no. But, as long as you are could you open your ribcage for me? I can't seem to-\"\n\n[As Medic and Heavy hold open Heavy's ribcage, they hear a loud crack and Heavy screams and reveals a rib in his hand.]\n\nHeavy: \"[Yells.]\"\n\nMedic: \"Aw, don't be such a baby, ribs grow back.\"\n\n[Medic takes the rib and throws it away. Turns around and talks to Archimedes.]\n\nMedic, whispering: \"No they don't.\"\n\n[Medic takes the mounted Medigun and brings it closer to Heavy. His organs and such all regenerate including his shirt and vest. Heavy smiles. There is a faint red glow in Heavy's chest, but it fades quickly.]\n\nHeavy: [Takes a deep breath.] \"What happens now?\"\n\nMedic: \"Now?\" [Chuckles while lifting Heavy up by the hands.] \"Let's go practice medicine.\"\n\n[As Medic dresses up and equips his tools, a drum plays in the background. He comes out of a door with shining light behind him and his doves flying out. The TF2 Soundtrack, MEDIC!, starts with the choir harp.]\n\n[As Medic comes out, Heavy runs forward and Demoman rushes towards Medic in a wheelchair and wrapped in bandages. Other members of RED are either hiding or hurt badly. Scout is on the ground, trying to stand, while Engineer and Sniper are hiding behind a rock. A wave of BLU Soldiers rushes toward them in the background.]\n\nDemoman: \"MEDIC!\"\n\n[Demoman gets hit with a rocket sending him flying and landing near Medic. Medic pushes his glasses up and flips a switch on the Medigun, then aims it at Demoman healing him. Demoman gets up whilst removing his cast and bandages. He then quickly nods at Medic and heads back towards battle. Medic spots Scout on the ground and goes to heal him as well. Scout gets off the ground, healing his (most likely broken) nose, his black eye, and he regrows his tooth.]\n\nScout: \"Oh, yeah!\"\n\n[Scout springs back up grabbing his baseball bat and runs. He hits a soldier with it around a corner.]\n\nScout: \"Woohoohoo! Oh, yeah!\"\n\n[Heavy is hiding behind a rock with and an army of Soldier's wearing different cosmetics advancing towards him.]\n\nHeavy, yelling: \"Doctor! Are you sure this will work?\"\n\nMedic, yelling back: \"Heheh, I have no idea!\"\n\n[Medic flips a few switches on his Medigun revealing a voltmeter that goes to Übercharge. He aims it at Heavy while he gets out of cover.]\n\nHeavy: \"[Yell's loudly.]\"\n\n[Heavy turns red with a glassy/shiny texture while the camera shows his heart pumping fast and is redder than usual.]\n\n[Heavy walks towards the army shooting his minigun. A couple of rockets hit him and covers the screen in smoke.]\n\n[Out of the smoke appears two glowing yellow eyes and fully reveals Heavy in his Übercharged state while walking forward.]\n\nHeavy, loudly: \"[Laughs,] I am bullet-proof!\"\n\n[Heavy and Medic walk forwards while it shows Sniper and Engineer hiding behind a rock showing surprise to Heavy's invincibility. Medic and Heavy both advance while Heavy mows down the enemies while absorbing their rockets.]\n\n[It then shows the feet of the soldiers when they run towards Heavy and Medic with many falling.]\n\n[Heavy and Medic climb a mound of corpses, Heavy specifically stepping on a Soldier wearing the cosmetic 'Armored Authority.]\n\n[The music crescendos as they climb up and it keeps its pitch when they reach the top. At the top Medic is posing in front of a glowing light while Heavy is slightly below him and to the right of the screen mowing down more enemies. Medic removes his beam from Heavy, but he is still Übercharged.]\n\n[Team Fortress 2 ending flourish music plays.]\n\n[Cut to most of the team sitting outside of Medic's Lab, waiting for the Übercharge implant. Engineer is playing his guitar quietly, Spy is checking the time, Soldier is standing at attention, Pyro is reading something while flicking their lighter, Demoman is drinking and Sniper is sleeping.]\n\n[Medic is muttering something outside the room.]\n\nScout, still in the Lab: \"Hey, thanks Doc.\"\n\n[The ticket counter outside the Lab goes from One to Two as Scout pushes open the door, his chest glowing red with the new Übercharge implant. Medic is seen in the room cleaning the chair.]\n\nScout: Ohohoh, man! You would not believe-\" [He pauses briefly,] \"-how much this hurts.\"\n\n[Something inside Scout's chest coos like a dove. Scout looks down at his chest in confusion.]\n\nMedic: Archimedes?", "time": "2023-03-25 16:53:57"}, "phaseadept": {"comment": "Can’t the Smerch fire those guided rockets?", "time": "2023-03-25 16:53:32"}, "syo": {"comment": "The first Grizzlies game I ever went to was a blowout loss to the Rockets, so I always get a little extra pleasure when we beat them.", "time": "2023-03-25 16:52:53"}, "freqkenneth": {"comment": "They’re firing 60,000 rockets \n\nA day.\n\nTheir economy did NOT collapse but Russia is basically China’s bitch now.\n\nGood news, bad news, it’s all propaganda\n\nIt’s a war after all", "time": "2023-03-25 16:51:58"}, "Mobius_Ace_1": {"comment": "&gt; So the solution is to dump it on your buddy. And you know someone has to take the time anyway \n\nYou know agreements exists right? We have one of those, in our team, everyone does the lab one week then rests for the next two. That's 3 runs every 3 weeks... it's pretty good and really works.\n\nSure, everyone can have a different agreement, but that's how flexible lab teams are. Go get one for your team.\n\n&amp;#x200B;\n\n&gt; I don't remember any of them not having at least one of them. And it's usually in several fights. Theowyn and sometimes Tasi can also sometimes make limbo out of dodges and hidings \n\nYou must be the unluckiest player I know for lab team then; just in my latest run I didn't get a single fight with either Zolrath or Thoran, and, usually, unless it's a boss fight you can choose another comp to path.\n\nIt's statiscally (almost) impossible to get forever Zolrath and Thoran in lab runs so, sorry for you being the unluckiest player ever for lab mode... but that's not the case for everyone out there.\n\nI'll try to record my next 3-5 lab runs (which may take a while, since it's my turn to rest now) and see how many Zol's or Thora's I get but I remember not being as common as in your case.\n\n&amp;#x200B;\n\n&gt; Unless the rotation doesn't allow or Zolrath decides to dodge sure \n\nAlmost every faction has a hero with a nuclear ult to finish everything in one-two ults for seconds per battle:\n\nLB: aBelinda, Scarlett\n\nWilders: aSolise\n\nGBs: aBaden\n\nCelestials: aTalene\n\nHyphogeans: Maetria\n\nDims: Ainz\n\nSure, almost everyone is an awakened but given the ammount of TG cards we have got lately + towers + other game rewards most players already have 1 or 2 aheros already. Not to mention all of us merc one other.\n\nWith all that, and 4 of 7 factions allowed per lab runs, it's impossible to not have a hero whom can clear lab fights in seconds, as long as the player know what it's doing. \n\nTo top it off, some heros, although not killing everything in one ult, do high damage with their ults and can also clear a fight in seconds like Kren, Mishka, Daimon, Athalia, Lucretia, etc. \n\n&amp;#x200B;\n\n&gt;Anyway, you still haven't explained how to do a lab and not skip it in 3 minutes \n\nSince you're being so literal with my words, read them again: I said 3-5 minutes, not that ALL take 3 minutes, let's start by that.\n\nWith your luck of facing at least one Zol or one Thoran in all your runs, sorry, my words doesn't apply to you... fortunately, it's just you, as I'm not aware of any other player facing always Zol and Thoran in their lab runs.\n\nIt's common to hit the 3 minute mark with good heros and relics like Perceptive spyglass, dawnbreaker, pendant of betrayal or the totem as the damage just sky rockets to not survivable levels... sure, it's luck dependant then, but that's why I listed 3-5 minutes.", "time": "2023-03-25 16:49:37"}}, "mooon": {"AutoModerator": {"comment": "Hi /u/cherry_mooon,\n\nWe restrict posting for new and/or low karma accounts. You'll need to participate around reddit and build up a bit of karma and/or let your account age a bit before you can participate here.\n\nWe don't disclose the limits, so please don't ask. Please note that we evaluate post karma and comment karma separately.\n\nYou might find [this guide for beginners](https://www.reddit.com/wiki/reddit_101) helpful.\n\n#NO, WE DO NOT OFFER VERIFICATION.\n\n#DO NOT MESSAGE THE MODERATORS ABOUT VERIFICATION OR THE LIMITS, YOU WILL BE MUTED.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Titties) if you have any questions or concerns.*", "time": "2023-03-25 14:37:52"}, "Sacoa": {"comment": "If Bitcoin goes too mooon .. silent \nif Bitcoin result a scam from satoshi.. silent", "time": "2023-03-25 05:52:23"}, "Gat0w": {"comment": "\"C'mooon don't *bee* nervous, just shake my hand!\"\n\n\"I think it's *knife* to meet you, so let's leave it at that.\"\n\n\"Hahahahaha.\" \n\n*Seconds before disaster.*\n\n[My Twitter](https://twitter.com/HeyItsGat0w), where I'll try to upload other stuff besides fgo. Take care everyone, and have a nice start to your weekend.", "time": "2023-03-25 04:12:36"}, "Competitive_Ice_189": {"comment": "That’s no mooon…", "time": "2023-03-24 17:57:05"}, "flxfrc666": {"comment": "C’est mooon aaaarbre eeeuh 😭", "time": "2023-03-24 15:55:29"}, "Sassy_fox": {"comment": "Then keep going up. TOO THE MOOON!!!!", "time": "2023-03-23 23:36:35"}, "JackF2022": {"comment": "$Olb go to the mooon !", "time": "2023-03-23 20:48:11"}, "Gangstas_Peridot": {"comment": "Like I wanted so much for the KS-23 shotgun to be in multiplayer. It's the most basic wooden stock shotgun and *that's why I want it!*\n\nMaybe they thought it would be too similar to the Stakeout in practice but c'mooon!", "time": "2023-03-23 15:26:47"}, "ThePepo85": {"comment": "#################\n\nDogecharts are not for checking.... You do not nead. It has and will have one way - TO THE MOOON!!!\n\n#################", "time": "2023-03-23 11:26:51"}, "culturevulture12": {"comment": "MOOON", "time": "2023-03-22 23:28:00"}}, "warp drive": {"CuriousWombat42": {"comment": "That is very neat! We had a very strange warp travel that made our planned to last less than a month trip be extended to 77 days total due to getting lost in a warpstorm maze, we had several fires, our seneshall went insane and my tech priestess got some uncanny insights into the future.\n\nWe basically agreed that we somehow made a drive by near Tzeenchs home base or something.", "time": "2023-03-25 16:08:33"}, "ThunderGTS": {"comment": "Reddick just engaged the warp drive. Goddamn.", "time": "2023-03-25 16:03:55"}, "I_Am_Jacks_Karma": {"comment": "Wait for real? I've literally never heard that before, I just assumed it was some warp/alcubierre drive type thing", "time": "2023-03-25 15:51:28"}, "mkten": {"comment": "Warp bubbles created by an Alcubierre Drive can't be controlled from within the bubble itself, so it's hypothetically possible that the immense gravity of a star is being used for triggering entry/exit points.", "time": "2023-03-25 15:14:24"}, "Electrical_Ad_7036": {"comment": "Sorry, I don’t know the name of the musical pieces. \n\nBut “Wrath of Khan”, when Kirk calls Spock from the cave &amp; then says, “I don't like to lose”. The music has a nice change to upbeat as your feeling “ Yeah! They had a plan”. \n\nThen after coming aboard on the bridge he asks for Tactical…..  the music is a short rolling melodic for the pause as the viewer sees the situation.\n\nFinally, after Genesis is activated, the music from the slow agonizing shots of the Enterprise trying to slowly get away.  Finally when Spock gets the warp drive working &amp; Kirk tells Sulu to hit it, the music gets up tempo &amp; triumphant.", "time": "2023-03-25 14:49:48"}, "No-Researcher-3184": {"comment": "Yeah you will see here that some have had great success and others have not. I had to replace z backlash components.  The z screw threading was counter rotated during production always making one side higher than the other. Among many other things like bed warp and a broken drive gear. It came cracked, on mine. That and the firmware was doing some bizarre movements hotends trying to escape the gantry when you turn it on.  \nAs far as connecting to your computer I have not tried.", "time": "2023-03-25 14:38:02"}, "FeralTribble": {"comment": "This kid is going to invent the first warp drive", "time": "2023-03-25 13:32:02"}, "oh_my_didgeridays": {"comment": "Hang on a minute. I saw a documentary that showed a ship using a warp drive to do FTL jumps. Are you telling me they faked it?", "time": "2023-03-25 12:46:33"}, "Holothuroid": {"comment": "It stands and falls with how easy it is to get around compared to how simple productions is. Warp Drive is space magic so depends on other space magic. Let's say they also have replicators.\n\nIf the latter are common trade in goods is unnecessary.", "time": "2023-03-25 12:02:07"}, "DanAykroydFanClub": {"comment": "For a slightly more upmarket one; the Grind in Kelham, Marmadukes in town or the Hidden Gem if you fancy a drive. Forge Bakehouse on Abbeydale\n\nGreasy spoon wise; the Crusty Cob in Kelham would be my go to. The Diner on Neepsend Lane, Cafe Pie in Walkley. Upperthorpe Cafe in Upperthorpe. \n\nObviously those are a bit influenced by areas in which I live/lived. Crusty Cob or Marmadukes, Norfolk Row would be my picks from the above. Cavell's if you fancy jumping into a little time warp.", "time": "2023-03-25 11:00:50"}}, "github": {"transcribersofreddit": {"comment": "If you would like to transcribe this post, please respond to this comment with `claiming` or `claim`. I will automatically mark this post as in progress so that only one person is working on a post at any given time. **Please check that the post does not break the parent sub’s rules before claiming.**\n\n\nWhen you're done, please comment again with `done`. Your flair will be updated to reflect the number of posts you've transcribed and the post will be marked as completed.\n\nHere's [a checklist](https://www.reddit.com/r/TranscribersOfReddit/wiki/checklist) that might help you out!\n\nPost type: image. Please use the following formatting:\n\n---\n\n**Note**: Use one of these format guides by copying and pasting everything in the blue markdown box and replacing the prompts with the relevant information. **If you are using New Reddit, please switch your comment editor to Markdown Mode, not Fancy Pants Mode.**\r\n\r\n**Remember**: We want to transcribe the text exactly as seen, so please do not make corrections to typos or grammatical errors. Copy emojis into your transcription by finding the proper character in Emojipedia.\r\n\r\n---\r\n\r\n\r\n[**Art and Images without Text**](https://www.reddit.com/r/TranscribersOfReddit/wiki/formats/images/no_text)\r\n\r\n[**Images with Text**](https://www.reddit.com/r/TranscribersOfReddit/wiki/formats/images/text)\r\n\r\n[**4chan &amp;amp; Pictures of Greentext**](https://www.reddit.com/r/TranscribersOfReddit/wiki/formats/images/greentext)\r\n\r\n[**Reddit Posts &amp;amp; Comments**](https://www.reddit.com/r/TranscribersOfReddit/wiki/formats/images/reddit)\r\n\r\n[**Social Media - Facebook, Instagram, Tumblr, Twitter**](https://www.reddit.com/r/TranscribersOfReddit/wiki/formats/images/socialmedia)\r\n\r\n[**Text Messages and Discord**](https://www.reddit.com/r/TranscribersOfReddit/wiki/formats/images/textmessages)\r\n\r\n[**Comics**](https://www.reddit.com/r/TranscribersOfReddit/wiki/formats/images/comics)\r\n\r\n[**GIFs**](https://www.reddit.com/r/TranscribersOfReddit/wiki/formats/images/gifs)\r\n\r\n[**Code**](https://www.reddit.com/r/TranscribersOfReddit/wiki/formats/images/code)\r\n\r\n[**Memes**](https://www.reddit.com/r/TranscribersOfReddit/wiki/formats/images/meme)\r\n\r\n[**Quora**](https://www.reddit.com/r/TranscribersOfReddit/wiki/formats/images/quora)\r\n\r\n[**Polls**](https://www.reddit.com/r/TranscribersOfReddit/wiki/formats/images/polls)\r\n\r\n[**Blaseball**](https://www.reddit.com/r/TranscribersOfReddit/wiki/format/image/blaseball)\r\n\r\n[**Other Sources**](https://www.reddit.com/r/TranscribersOfReddit/wiki/formats/images/other)\r\n\r\n---\r\n\r\nYou can [see some example transcriptions here.](https://www.reddit.com/r/TranscribersOfReddit/wiki/examples/images)\n\n---\n\nReporting\n---\n\nPlease report this post if it contains personal information or otherwise breaks the rules of the partner subreddit. The mods will check and remove it shortly.\n\nIf you have any questions, feel free to [message the mods!](https://www.reddit.com/message/compose?to=%2Fr%2FTranscribersOfReddit&amp;subject=General%20Question&amp;message=)\n\n---\n\nFooter\n---\n\n**Please Note:** If you are trying to transcribe on Reddit mobile, you will not be able to copy/paste this footer. Please switch to your mobile browser and copy the footer to a note file on your device.\n\nWhen you're done, please put the following footer at the **bottom** of your post:\n\n---\n\n    ^^I'm&amp;#32;a&amp;#32;human&amp;#32;volunteer&amp;#32;content&amp;#32;transcriber&amp;#32;and&amp;#32;you&amp;#32;could&amp;#32;be&amp;#32;too!&amp;#32;[If&amp;#32;you'd&amp;#32;like&amp;#32;more&amp;#32;information&amp;#32;on&amp;#32;what&amp;#32;we&amp;#32;do&amp;#32;and&amp;#32;why&amp;#32;we&amp;#32;do&amp;#32;it,&amp;#32;click&amp;#32;here!](https://www.reddit.com/r/TranscribersOfReddit/wiki/index)\n\n---\n\n\n---\n\nv0.6.0 | This message was posted by a bot. | [FAQ](https://www.reddit.com/r/TranscribersOfReddit/wiki/index) | [Source](https://github.com/GrafeasGroup/tor) | Questions? [Message the mods!](https://www.reddit.com/message/compose?to=%2Fr%2FTranscribersOfReddit&amp;subject=Bot%20Question&amp;message=)", "time": "2023-03-25 17:03:25"}, "sub_doesnt_exist_bot": {"comment": "The subreddit r/tunesposting does not exist.\n\nDid you mean?:\n\n* r/baneposting (subscribers: 10,396)\n* r/LUPosting (subscribers: 1,136)\n\nConsider [**creating a new subreddit** r/tunesposting](/subreddits/create?name=tunesposting).\n\n---\n^(🤖 this comment was written by a bot. beep boop 🤖)\n\n^(feel welcome to respond 'Bad bot'/'Good bot', it's useful feedback.)\n^[github](https://github.com/Toldry/RedditAutoCrosspostBot) ^| ^[Rank](https://botranks.com?bot=sub_doesnt_exist_bot)", "time": "2023-03-25 17:03:57"}, "unexBot": {"comment": "**OP sent the following text as an explanation on why this is unexpected:**\n\n&gt;!His front wheel coming off and him doing a Superman!&lt;\n\n*****\n**Is this an unexpected post with a fitting description?**\n**Then upvote this comment, otherwise downvote it.**\n\n*****\n[*Look at my source code on Github*](https://github.com/Artraxon/unexBot) [*What is this for?*](https://www.reddit.com/r/Unexpected/comments/dnuaju/introducing_unexbot_a_new_bot_to_improve_the/)", "time": "2023-03-25 17:03:37"}, "transcribot": {"comment": "at 1:28 AM\n\n1-0 J.S\n\n(edited) JJ\n\nfoday at 5:10 AM\n\nNot sorry\n\nroday at 6:23 AM\n\nThats creeov\n\n\n\n---\n\nvv1679346257 | This message was posted by a bot. | [FAQ](https://www.reddit.com/r/TranscribersOfReddit/wiki/index) | [Source](https://github.com/GrafeasGroup/tor_ocr/) | Questions? [Message the mods!](https://www.reddit.com/message/compose?to=%2Fr%2FTranscribersOfReddit&amp;subject=Bot%20Question&amp;message=)", "time": "2023-03-25 17:03:37"}, "Igor_Misic": {"comment": "Shor t answer: yes!  \nLonger answer:  \nBefore I started working for PX4 I was experimenting with bare-metal code at Pixracer.   \nPixracer and Pixhawk are very similar, here is my repo where I implemented a couple of things using only HAL from STM32 or libopencm3. You will maybe find it useful.  \n[https://github.com/Igor-Misic/Pixracer-examples](https://github.com/Igor-Misic/Pixracer-examples) (shot is done with STM32 HAL, miniblink with libopencm3)  \nI can also add, that you can do all you wish in PX4, it will not be much different than bare-metal, but this depends on your experience with STM32 HAL vs PX4 environment.", "time": "2023-03-25 17:03:31"}, "home2de": {"comment": "Thanks! So future Github Next extensions including  Copilot for Pull Requests will also require the cloud license rather than the GHES?", "time": "2023-03-25 17:02:59"}, "VideoDownloadNode": {"comment": "*beep. boop.* 🤖 I'm a bot that helps downloading videos!\n\n##[Download via Reddit.Tube](https://redirect.videodownloadnode.com/redirect.html?https://www.reddit.tube/r/u_Naomi_Soraya/comments/yzbs7h/think_you_could_last_in_my_tight_pussy/)\n\nI also work with links sent by PM. Don't be afraid to upvote :) Read Profile for more info\n\n ***  \n[**Info**](https://np.reddit.com/user/VideoDownloadNode)&amp;#32;|&amp;#32;[**Support&amp;#32;me&amp;#32;❤**](https://ko-fi.com/videodownloadnode)&amp;#32;|&amp;#32;[**Github**](https://github.com/TheNode)&amp;#32;|&amp;#32;[**Private Message**](https://www.reddit.com/message/compose/?to=VideoDownloadNode&amp;subject=Paste%20the%20video%20link%20below)", "time": "2023-03-25 17:02:50"}}}